[
  {
    "title": "1. Introduction",
    "content": "This Cookies Policy explains how Cephie Studios uses cookies and similar technologies when you visit our website and use our Services. We use cookies to enhance your experience, analyze usage patterns, and improve our Services."
  },
  {
    "title": "2. What Are Cookies?",
    "content": "Cookies are small text files that are placed on your device when you visit our website. They help us provide you with a better experience by remembering your preferences, analyzing how you use our site, and improving our services."
  },
  {
    "title": "3. How We Use Cookies",
    "content": "We use cookies for various purposes, including:",
    "subsections": [
      {
        "title": "Essential Cookies",
        "content": "Required for basic website functionality"
      },
      {
        "title": "Functional Cookies",
        "content": "To remember your preferences"
      },
      {
        "title": "Performance Cookies",
        "content": "For tracking and statistics"
      }
    ]
  },
  {
    "title": "4. Managing Cookie Preferences",
    "content": "You can manage your cookie preferences in several ways:",
    "subsections": [
      {
        "title": "Consent Banner",
        "content": "Use our cookie consent banner when you first visit our site"
      },
      {
        "title": "Settings Page",
        "content": "Access the Settings page (requires login) to update your preferences at any time"
      },
      {
        "title": "Browser Settings",
        "content": "Modify your browser settings to control cookies"
      }
    ],
    "additionalContent": "Please note that some features may not be available if you choose to reject certain cookies."
  },
  {
    "title": "5. Cookie Types",
    "subsections": [
      {
        "title": "CSRF Protection Cookie",
        "content": "Required for security during authentication. Helps prevent Cross-Site Request Forgery attacks during the Discord login process.",
        "example": "Example: csrf_token"
      },
      {
        "title": "Authentication Cookie",
        "content": "Stores your Discord user information and authentication state. Enables you to stay logged in and access your account features.",
        "example": "Example: discord_user"
      },
      {
        "title": "Admin Authentication Cookie",
        "content": "Used for admin authentication and access control. Only set when an administrator logs in.",
        "example": "Example: adminToken"
      },
      {
        "title": "Functional Cookies",
        "content": "Enhance your experience by remembering your preferences and settings. Enable personalized features and improved usability.",
        "example": "Examples: language_preference, theme_settings"
      },
      {
        "title": "Flight Data Cookies",
        "content": "Cache flight statistics and related data to improve performance and reduce API calls. Store temporary flight information for faster access.",
        "example": "Examples: flight_cache, route_data"
      }
    ]
  },
  {
    "title": "6. Cookie Duration",
    "subsections": [
      {
        "title": "Session Cookies",
        "content": "Temporary cookies that are deleted when you close your browser. Used for maintaining your session and basic functionality.",
        "examples": "Examples: Authentication state, temporary flight data"
      },
      {
        "title": "Persistent Cookies",
        "content": "Remain on your device for a set period or until manually deleted. Used for remembering preferences and improving your experience.",
        "examples": "Examples: Language settings, theme preferences"
      }
    ]
  },
  {
    "title": "7. Managing Cookies",
    "content": "You can control cookies through your browser settings. Most web browsers allow you to:",
    "subsections": [
      {
        "title": "View Cookies",
        "content": "See cookies stored on your computer"
      },
      {
        "title": "Delete Cookies",
        "content": "Remove all or specific cookies"
      },
      {
        "title": "Block Cookies",
        "content": "Prevent all or specific types of cookies"
      }
    ],
    "additionalContent": "Please note that disabling essential cookies may prevent you from using certain features of our Services. For example, authentication cookies are required to log in to your account."
  },
  {
    "title": "8. More Information",
    "content": "To learn more about cookies and how to manage them, visit allaboutcookies.org."
  },
  {
    "title": "9. Updates to This Policy",
    "content": "We may update this Cookie Policy from time to time. Any changes will be posted on this page with an updated revision date. Please check back regularly to stay informed about how we use cookies."
  }
]
